INSERT INTO public.users (id, email, password, role, username)
VALUES ('heisyenberg@gmail.com',
        '$2a$10$STfLBQ1JPJ6lLMpCPf17bebErSzr69TyJrVnmbcrC3SDlQVKFAXp.',
        'ROLE_ADMIN', 'HeisYenberg');

INSERT INTO books (author, genre, image_name, price, title, description)
values ('Рэй Брэдбери', 'Научная фантастика',
        '1710191237722_fahrenheit_451.jpg', 288, '451 градус по Фаренгейту',
        '«451 градус по Фаренгейту» — научно-фантастический роман-антиутопия Рэя Брэдбери, изданный в 1953 году. Роман описывает американское общество близкого будущего, в котором книги находятся под запретом; «пожарные», к числу которых принадлежит и главный герой Гай Монтэг, сжигают любые найденные книги.'),
       ('Лев Толстой', 'Роман', 'war_and_peace_pt1.png', 288,
        'Война и мир. Кн.1.',
        'Война и мир» – русский исторический (и немного фантастический) роман Льва Толстого, опубликованный в 1865-1869 годах. В романе рассказывается о союзах и войнах между Россией и Францией в начале XIX века, а также о жизни персонажей, увлекаемых историческими событиями. «Война и мир» считается одним из самых значительных романов в русской и мировой литературе, по нему были сняты фильмы, телепередачи и многое другое.'),
       ('Михаил Булгаков', 'Роман', 'master_and_margarita.png', 219,
        'Мастер и Маргарита',
        'В основе романа лежит история визита дьявола в Москву в 1930-х годах. Он сеет хаос среди литературной и культурной элиты и даёт спасение главным героям: Мастеру, писателю, доведённому до безумия подавлением его творчества, и Маргарите, его преданной возлюбленной.'),
       ('Лев Толстой', 'Роман', 'anna_karenina.png', 268, 'Анна Каренина',
        'Анна Каренина — уважаемая, красивая и хорошо образованная светская дама, павшая жертвой любви. Она — любящая мать и страстная любовница, умная собеседница и блестящая хозяйка дома. Изысканностью манер и оригинальностью рассуждений образ Анны Карениной пленяет многих читателей. Но пойдя против законов общества, она оказалась не готова к последствиям, что и стало причиной её трагического конца.'),
       ('Иван Гончаров', 'Роман', 'oblomov.png', 250, 'Обломов',
        'Роман Ивана Александровича Гончарова (1812–1891) "Обломов" (1859) – одно из важнейших произведений русской литературы XIX века. Он затрагивает острые социальные проблемы того времени: тяжёлую жизнь крепостных крестьян, лень и праздность помещиков. Образ главного героя – Ильи Ильича Обломова – настолько правдиво и точно отразил распространённый типаж русского дворянства XIX века, что понятие "обломовщина" сразу вошло в обиход.'),
       ('Лев Толстой', 'Роман', 'war_and_peace_pt2.png', 288,
        'Война и мир. Кн.2',
        'Война и мир» – русский исторический (и немного фантастический) роман Льва Толстого, опубликованный в 1865-1869 годах. В романе рассказывается о союзах и войнах между Россией и Францией в начале XIX века, а также о жизни персонажей, увлекаемых историческими событиями. «Война и мир» считается одним из самых значительных романов в русской и мировой литературе, по нему были сняты фильмы, телепередачи и многое другое.'),
       ('Оруэлл Джордж', 'Научная фантастика', '1984.jpg', 513, '1984',
        '«1984» – это роман о том, как репрессивная машина тоталитарного государства может уничтожить любую личность. Даже Смит, который до последнего сопротивлялся тирании, в конце концов сдался. Сначала его уничтожили физически (в прямом смысле слова – он начал терять зубы и т. д.). Затем он, наконец, лишился своих убеждений.'),
       ('Федор Достоевский', 'Роман', 'crime_and_punishment.jpg', 250,
        'Преступление и наказание', '«Преступление и наказание» — это роман Фёдора Достоевского с криминальным сюжетом и глубокой религиозно-философской подоплёкой.

Главный герой, нищий и болезненно гордый студент Родион Романович Раскольников, решает проверить, способен ли он на поступок, возвышающий его над «обычными» людьми. Для этого он убивает старую ростовщицу, а затем и её сестру, случайно оказавшуюся на месте преступления.'),
       ('Федор Достоевский', 'Роман', '1709422955340idiot.jpg', 239, 'Идиот',
        'Роман русского писателя и философа XIX века Федора Достоевского «Идиот» (1868) рассказывает о русском князе Мышкине, который возвращается в Россию после пребывания в санатории и оказывается втянутым в любовный треугольник с двумя женщинами, Настасьей и Аглаей. Мышкин добродушен до глубины души, но конкурентные и бесчувственные порывы окружающих побеждают его устремления.'),
       ('Эрнест Хемингуэй', 'Роман', '1709423410760for_the_bell_talls.jpg',
        379, 'По ком звонит колокол', '«По ком звонит колокол» — роман Эрнеста Хемингуэя, вышедший в 1940 году.

В произведении рассказывается история Роберта Джордана, молодого американского бойца Интернациональных бригад, отправленного в тыл франкистов, к партизанам, во время Гражданской войны в Испании. Ему как эксперту-подрывнику поручено взорвать мост, чтобы предотвратить подход франкистских подкреплений при атаке на Сеговию.'),
       ('Александр Пушкин', 'Роман в стихах',
        '1709427890937evgeniy_onegin.jpg', 200, 'Евгений Онегин', 'Евгений Онегин – повествовательный роман в стихах, написанный великим русским писателем Александром Пушкиным.
Сюжет вращается вокруг жизни главного героя, Евгения Онегина, изнеженного и высокомерного молодого человека, который получает в наследство имение и переезжает в деревню, где встречает и отвергает девушку по имени Татьяна Ларина, однако позже осознаёт свою любовь к ней, что приводит к трагическим последствиям.'),
       ('Николай Гоголь', 'Поэма', '1709454313191dead_souls.jpg', 200,
        'Мертвые души',
        'Произведение, охарактеризованное автором как поэма. В «Мертвых душах» рассказывается о дворянине Чичикове, который решает скупить у губернских помещиков мертвых крестьян, чтобы заложить их в казну по цене живых. Главные литературные ценности поэмы – уникальные типажи помещиков, тонко и точно прописанные Гоголем, ироническое описание светского общества российской губернии, а также образ повествователя.'),
       ('Джек Лондон', 'Роман', '1709480739133martin_iden.jpg', 538,
        'Мартин Иден', 'Мартин Иден: роман Лондона о разочаровании в собственных мечтах.
Мартин Иден – рабочий парень, моряк, выходец из низов случайно знакомится с Руфью Морз – девушкой из состоятельной буржуазной семьи. Желая стать достойным нее и попав под обаяние высшего общества Мартин берется за самообразование. Узнав, что журналы платят приличные гонорары авторам рассказов Мартин берется за писательство будучи уверенным, что может писать гораздо лучше других.'),
       ('Александр Пушкин', 'Историческая проза',
        '1709480823453captains_dother.jpg', 200, 'Капитанская дочка',
        '«Капитанская дочка» представляет собой исторический роман (в некоторых источниках – повесть), написанный А.С. Пушкиным. Автор повествует нам о зарождении и развитии большого и сильного чувства между молодым знатным офицером и дочерью коменданта крепости. Все это происходит на фоне восстания Емельяна Пугачева и создает для влюбленных дополнительные преграды и трудности в жизни.'),
       ('Михаил Лермонтов', 'Психологический роман',
        '1709480897211herous_of_our_time.jpg', 250, 'Герой нашего времени',
        '"Герой нашего времени" (1840) - первый лирико-психологический роман в русской литературе. В нём описываются события из жизни на Кавказе молодого офицера с пылким нравом Григория Александровича Печорина. Главный герой - собирательный образ "лишнего человека".'),
       ('Уильям Шекспир', 'Проза', '1709509218124_romeo_and_juliet.jpg',
        229, 'Ромео и Джульетта. Отелло', '«Отелло» — это трагедия Уильяма Шекспира, написанная около 1603 года.

Действие происходит во время венецианско-турецкой войны (1570–1573) за контроль над островом Кипром, с 1489 г. принадлежавшим Венецианской республике.

Сюжет разворачивается вокруг двух персонажей: Отелло и Яго.'),
       ('Фрэнк Герберт', 'Научная фантастика', '1709537984820_dune.jpg',
        756, 'Дюна',
        '«Дюна» Фрэнка Герберта – научно-фантастический роман о Поле Атрейдесе, 15-летнем сыне герцога Лето, который отправляется на пустынную планету Арракис. После свержения дома Атрейдесов Пол становится мессией для коренных жителей Арракиса, фременов, и исполняет тысячелетнее предсказание о рождении человека с огромным предвидением, которое позволит ему видеть прошлое и будущее.'),
       ('Александр Грибоедов', 'Комедия', '1710197198433_sad_but_smart.jpg',
        211, 'Горе от ума',
        '«Го́ре от ума́» — комедия в стихах Александра Сергеевича Грибоедова. Сочетает в себе элементы классицизма и новых для начала XIX века романтизма и реализма. Описывает светское общество времён крепостного права и показывает жизнь 1813—1824'),
       ('Уайльд Оскар', 'Готическая литература',
        '1710197406778_portrait_of_dorian_grey.jpg', 513,
        'Портрет Дориана Грея',
        'Главная героиня – молодая женщина, специалист по старинной английской живописи, встречает художника, который просит ее идентифицировать уникальный загадочный портрет. Фантазия переносит женщину во времена создания картины, и она начинает описывать события, происходящие в то время, сто лет назад.'),
       ('Михаил Булгаков', 'Повесть', '1710197852252_dogs_heart.jpg', 219,
        'Собачье сердце',
        '«Собачье сердце» – сатирический роман Михаила Булгакова, в котором рассказывается история бродячего пса по имени Шарик, превращённого в человека сумасшедшим учёным. Приспосабливаясь к новой жизни, Шарик начинает демонстрировать всё более дикое и вульгарное поведение, вызывая хаос и бросая вызов представлениям о том, что значит быть человеком.'),
       ('Иван Тургенев', 'Роман', '1710197956343_fathers_and_childrens.jpg',
        219, 'Отцы и дети',
        'Иван Сергеевич Тургенев (1818–1883) в своём романе "Отцы и дети" (1862) показывает становление общественных сил в России накануне реформы 1861 года, раскол на два лагеря: либералов-дворян и демократов-разночинцев. Писатель первым в русской литературе открыл тип "нигилиста" — отрицателя всех и всего Евгения Базарова.');